backend/app/controllers/concerns/authenticatable.rb

  def authenticate_user!
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded = JwtService.decode(token)
      @current_user = User.find(decoded['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 7 LIMIT 1