backend/app/controllers/api/auth_controller.rb

  def register
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("name", "email", "phone", "address", "password_digest", "is_admin", "reward_points", "member_since", "created_at", "updated_at") VALUES ('Test User', 'test@example.com', '+1234567890', '123 Test St', '$2a$12$vfhavspzASXh4vY3/mP1OedGYSgongnvX.GxG2ga1CwV7swJuPdjG', 0, 0, '2025-08-01 21:32:14.706217', '2025-08-01 21:32:14.705701', '2025-08-01 21:32:14.705701') RETURNING "id"