backend/app/controllers/api/menu_items_controller.rb

  def index
    menu_items = MenuItem.all
---
SELECT "menu_items".* FROM "menu_items"