backend/app/controllers/api/orders_controller.rb

  def index
    if current_user.is_admin?
      orders = Order.includes(:user, :order_items, :menu_items).recent
    else
      orders = current_user.orders.includes(:order_items, :menu_items).recent
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 1

  def create
    order = current_user.orders.build(status: 'pending')

    # Add items from cart first
    params[:items].each do |item_data|
      menu_item = MenuItem.find(item_data[:menu_item_id])
      order_item = order.add_item(menu_item,
        quantity: item_data[:quantity],
        size: item_data[:size],
        customizations: item_data[:customizations] || []
      )
      Rails.logger.info "Added item: #{order_item.inspect}"
    end

    # Calculate total before saving
    order.calculate_total
    Rails.logger.info "Order total: #{order.total}"
    Rails.logger.info "Order valid? #{order.valid?}"
    Rails.logger.info "Order errors: #{order.errors.full_messages}" unless order.valid?

    if order.save
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = 1 LIMIT 1
INSERT INTO "order_items" ("order_id", "menu_item_id", "quantity", "price", "size", "customizations", "created_at", "updated_at") VALUES (1, 1, 2, 2.5, 'Single', '["Sugar"]', '2025-08-01 22:02:53.901290', '2025-08-01 22:02:53.901290') RETURNING "id"
INSERT INTO "orders" ("user_id", "total", "status", "order_date", "created_at", "updated_at") VALUES (1, 5.0, 'pending', '2025-08-01 22:02:53.846870', '2025-08-01 22:02:53.874064', '2025-08-01 22:02:53.874064') RETURNING "id"